rails-first-routes/first_routes/app/controllers/artworks_controller.rb

    def index
        if params[:artist_id]
            artworks = Artwork.where(artworks: {artist_id: params[:artist_id]})
            render json: artworks
        else
            artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE (artist_id = '2')
SELECT "artworks".* FROM "artworks" WHERE (artist_id = '1')

    def show
        incoming_wildcard = params[:id]
		artwork = Artwork.find(incoming_wildcard)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]