rails-first-routes/first_routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2], ["created_at", "2023-03-09 22:19:52.887517"], ["updated_at", "2023-03-09 22:19:52.887517"]]
---
    def create
        shares = ArtworkShare.new(artwork_share_params)
        if shares.save

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]
---
    def destroy
		incoming_wildcard = params[:id]
		shares = ArtworkShare.find(incoming_wildcard)
		shares.destroy