rails-first-routes/first_routes/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("commenter_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter_id", 1], ["artwork_id", 1], ["body", "Love this!"], ["created_at", "2023-03-10 00:42:34.601707"], ["updated_at", "2023-03-10 00:42:34.601707"]]