rails-first-routes/first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "kat123"]]
SELECT "users".* FROM "users"
---
    def index
        # debugger
        if user_params[:username]
            user = User.where(username: user_params[:username])
            render json: user
        else
            users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        incoming_wildcard = params[:id]
		user = User.find(incoming_wildcard)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "username" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-03-09 20:02:10.354179"], ["username", "ArakiH"], ["id", 5]]
---
    def update
		incoming_wildcard = params[:id]
		user = User.find_by(id: incoming_wildcard) # id: params[:id] also works
		if user && user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
		incoming_wildcard = params[:id]
		user = User.find(incoming_wildcard)
		user.destroy